/**
 * Алгоритм: Сортировка слияниями
 * Тип: Сортировка(стабильная)
 * 
 * Скорость: O(n log n)
 * Память: O(n)
 * 
 * Основная идея данной сортировки лежит в разделении вниз. Чтобы не дублировать проход по элементам, как это 
 * было в сортировке выбором, вставками и тд, мы начинаем сортировать "в ширь". 
 * 
 * Каждый раз мы "условно" делим нащ массив на два маленьких подмассива. 1 левве другого. Затем делаем это опять. Опять. Опять...
 * Рано или поздно, но мы дойдём до случая, когда в массиве будет 1 элемент. Это значит, что этот массив отсортиован. Круто...
 * 
 * Теперь перейдём на шаг выше, из которого мы получили эти два единичных массива. Теперь мы можем отсортировать их. Поскольку в каждом из них выполняется условие, 
 * что оба массива упорядоченны относительно себя. Это значит, что мы можем за линию(O(n)) упорядочить их в массив, состоящий уже из элементов обоих этиих массивов.
 *
 * Данную операцию мы можем повторить до самой верхушки.
 *
 * Поскольку мы делим на два, то глубина погружения - кол-во слоёв разбиений = log_2 n.
 * На каждом таком слое мы проходимя по массивам, длины 2^(-k). При этом, поскольку слоёв тоже 2^k: на каждом слое суммарно мы делаем n операций проходок.
 * Отсюда и асимптотика O(n log n)
 * 
 * Данная сортировка стабильна, и имеет ПОСТОЯННУЮ асимптотику, а не как ебучий quicksort.
 */

#include <iostream>
#include "algosiki.h"
using namespace std;

void merge_sort(Data* array, long left, long right) {
    if (right-left==1) return; // базовый случай, если наткнулись на единичный массив - ничего не делаем.
    long mid = (left+right)/2; // ищем центральный индекс, чтобы разбить на два подмассива.

    //
    // Вызываем для левой и правой стороны. Мы делаем это до пересборки массива, так-как хотим, чтобы на моменте пересборки левый и правый массив были отсортированы.
    //
    merge_sort(array, left, mid);
    merge_sort(array, mid, right);

    // Выделяем память для временного массива.
    Data* sub_array = new Data[right-left];

    // Пока оба индекса(левый и правый) не вышли за рамки массивов, мы собираем временный массив сразу в упорядоченном статуск.
    long i = 0, left_half = left, right_half = mid; 
    while (left_half < mid && right_half < right) {
        if (array[left_half].payload < array[right_half].payload) {
            sub_array[i++] = array[left_half++];
        } else {
            sub_array[i++] = array[right_half++];
        }
    }
    // Так как while завершил работу мы знаем, массивов был полностью перенесён. Это значит, что все
    // элементы оставшегося массива являются больше, чем все, что были добавлены до этого.
    // поскольку один из индексов уже равен mid или right, отработает только 1 из циклов снизу.
    while (left_half < mid) sub_array[i++] = array[left_half++];
    while (right_half < right) sub_array[i++] = array[right_half++];
    
    // Перезаписываем исходный массив
    for (size_t j = 0; j < right-left; j++) {
        array[left+j] = sub_array[j];
    }

    // Освобождаем память
    delete[] sub_array;
}

int main() {

    /// Стандартный ввод

    size_t n;
    cin >> n;

    Data* data = new Data[n];

    for (size_t i = 0; i < n; i++) {
        int32_t key, val;
        cin >> key >> val;
        data[i] = { key, val };
    }

    /// Стандартный ввод

    // Выводим исходный массив
    print_array(data, n, fn_print_data);
    cout << endl;

    // Вызываем сортровку
    merge_sort(data, 0, n);
    
    // Выводим отсортированный массив
    print_array(data, n, fn_print_data);

    return 0;
}